## About this Workshop

This workshop is designed as an introduction to using the package known as pandas.  

By the end of this workshop, you should be able to:  
    -read a csv into a dataframe  
    -filter by columns  
    -run some basic statistics on that dataframe  
    -graph the data using a second package called seaborn.  

In addition to the 3 notebooks we will be working off of here, a second version is available at: https://github.com/mkitti/pandas-workshop which has been designed to run through google's [Colab environment](https://colab.research.google.com/notebooks/welcome.ipynb#recent=true).  If you are having difficulty downloading the files, this option allows for you to run all of the code through the web.

## Introduction to Pandas

[Pandas](http://pandas.pydata.org/) is the essential data analysis library for Python programmers. It provides fast and flexible data structures built on top of [numpy](http://www.numpy.org/).

It is well suited to handle "tabular" data (that might be found in a spreadsheet), time series data, or pretty much anything you care to put in a matrix with rows and named columns.

It contains two primary data structures, the `Series` (1-dimensional) and the `DataFrame` (2-dimensional) as well as a host of convenience methods for loading and working with data.

The main thing that makes pandas pandas is that all data is *intrinsically aligned*. That means each data structure, `DataFrame` or `Series` has something called an **Index** that links data values with a label. That link will always be there (unless you explicitly break or change it) and it's what allows pandas to quickly and efficiently "do the right thing" when working with data.

In [1]:
# The canonical way to import pandas:
import pandas as pd
import numpy as np

## The `Series` Object

A `Series` is a one-dimensional array of indexed data.

In [2]:
data = pd.Series([0.1, 0.2, 0.3, 0.4])
data

0    0.1
1    0.2
2    0.3
3    0.4
dtype: float64

The `Series` wraps a 1-d `ndarray` from numpy and an `Index` object.

In [3]:
#changes thing to a numpy array
print(data.values)
type(data.values)

[0.1 0.2 0.3 0.4]

numpy.ndarray

In [4]:
data.index

RangeIndex(start=0, stop=4, step=1)

In [5]:
# This particular index type, the `RangeIndex`, lets us use the
# same square-bracket notation as a `ndarray` to access elements:
data[0]

0.1

In [6]:
data.values[0]

0.1

In [7]:
# or even a slice:
data[1:3]

1    0.2
2    0.3
dtype: float64

We don't have to use this auto-generated list of integers as the index though. Index values can be specified manually and don't even have to be integers.

In [8]:
#index names can be repeated, but then will call both
data = pd.Series([0.1, 0.2, 0.3, 0.4], index=['a', 'b', 'c', 'd'])
data

a    0.1
b    0.2
c    0.3
d    0.4
dtype: float64

In [9]:
data.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [10]:
# Item access works just like before, with square brackets, 
# even though the index values are strings
data['a']

0.1

In [11]:
#once you have labels, you can also access them this way (assuming no spaces in name)
data.a

0.1

In [12]:
# slices still work! But note the last element is included this time.
# This is the default behavior for indexes.
data['a':'c']

a    0.1
b    0.2
c    0.3
dtype: float64

In [13]:
# We could create a non-sequential integer index:
data = pd.Series([0.1, 0.2, 0.3, 0.4], index=[5, 8, 2, 1])
data

5    0.1
8    0.2
2    0.3
1    0.4
dtype: float64

In [14]:
data.index

Int64Index([5, 8, 2, 1], dtype='int64')

In [15]:
#recall this is a numpy array now, so it is grabbing the index of 1
data.values[1]

0.2

In [16]:
# Why?
#this one is calling the pandas index of 1
data[1]

0.4

Remember that the values command (data.values) is converting the column into a numpy array.  That means any indexing follows the numpy rules (which are based on position), not the pandas rules (which are based on index)

`Series` are in fact a cross between a numpy array and a python dictionary. You can think of them as a dictionary with *typed* keys and *typed* values.

In [17]:
# in fact it is easy to convert a dictionary into a series
max_depths_dict = {
    'Erie': 64,
    'Huron': 229,
    'Michigan': 281,
    'Ontario': 244,
    'Superior': 406,
}
max_depths = pd.Series(max_depths_dict)
max_depths

Erie         64
Huron       229
Michigan    281
Ontario     244
Superior    406
dtype: int64

In [18]:
# squint and it looks like a dictionary!
max_depths['Michigan']

281

In [19]:
max_depths_dict['Michigan']

281

In [20]:
# Notice the index in this case was constructed automatically
# from the dictionary keys.
max_depths.index

Index(['Erie', 'Huron', 'Michigan', 'Ontario', 'Superior'], dtype='object')

## `Series` Exercise

Create `Series` objects from a list, a numpy 1-dimensional `ndarray`, and a dictionary.

In [23]:
astronomical_objects_dict = {
    'Stars': 100,
    'Planets': 1,
    'Comets': 10,
    'Galaxies': 1000
}
astronomical_objects = pd.Series(astronomical_objects_dict)
astronomical_objects

Stars        100
Planets        1
Comets        10
Galaxies    1000
dtype: int64

In [27]:
greetings = pd.Series(['hi','hello','whats up','salutations'],index = [1,2,3,4])
greetings

1             hi
2          hello
3       whats up
4    salutations
dtype: object

## Numpy and `Series`

Because the values in a `Series` are contained in a numpy `ndarray`, `Series` provides all the benefits of numpy! Namely, this means we get ultra-fast vectorized math operations on the elements of a `Series`.

In [25]:
max_depths * 10

Erie         640
Huron       2290
Michigan    2810
Ontario     2440
Superior    4060
dtype: int64

You can use most numpy functions directly on a `Series` object (and later, we'll see `DataFrame` objects as well), but pandas also provides access to these numpy functions through the `Series` object methods.

In [28]:
np.sin(max_depths)

Erie        0.920026
Huron       0.329962
Michigan   -0.985151
Ontario    -0.864536
Superior   -0.670252
dtype: float64

In [29]:
#using numpy mean
np.mean(max_depths)

244.8

In [30]:
#using pandas
max_depths.mean()

244.8

In [31]:
#and if you are lazy and just want a bunch of standard stats
max_depths.describe()

count      5.000000
mean     244.800000
std      122.713895
min       64.000000
25%      229.000000
50%      244.000000
75%      281.000000
max      406.000000
dtype: float64

`Series` objects also support numpy-style Boolean mask indexing:

In [32]:
#filtering things
max_depths[max_depths > max_depths.mean()]

Michigan    281
Superior    406
dtype: int64

And numpy's so-called "fancy indexing", IE using a list or array to specify values to access:

In [33]:
max_depths[['Erie', 'Huron']]

Erie      64
Huron    229
dtype: int64

## The DataFrame Object

Much like the `Series` is a one-dimensional array of indexed data, a `DataFrame` is a two-dimensional array of indexed data.

You can think of a `DataFrame` as a sequence of `Series` objects all sharing the same index.

In [34]:
avg_depths_dict = {
    'Erie': 19,
    'Huron': 59,
    'Michigan': 85,
    'Ontario': 86,
    'Superior': 149,
}

avg_depths = pd.Series(avg_depths_dict)
#specifying the column names and combining the two series into a data frame
#works even if the names are in different orders (need to have the same indicies between the two series)
lakes = pd.DataFrame({'Max Depth (m)': max_depths, 'Avg Depth (m)': avg_depths})
lakes

          Max Depth (m)  Avg Depth (m)
Erie                 64             19
Huron               229             59
Michigan            281             85
Ontario             244             86
Superior            406            149

Just like the `Series`, a `DataFrame` has an `index` property.

In [35]:
lakes.index

Index(['Erie', 'Huron', 'Michigan', 'Ontario', 'Superior'], dtype='object')

And a `values` property that exposes the underlying `ndarray`.

In [36]:
lakes.values

array([[ 64,  19],
       [229,  59],
       [281,  85],
       [244,  86],
       [406, 149]])

And unlike the Series, the DataFrame has a `columns` property, which is also an index.

In [37]:
lakes.columns

Index(['Max Depth (m)', 'Avg Depth (m)'], dtype='object')

We can get the shape of a dataframe, just like a numpy ndarray:

In [38]:
#rows & columns
lakes.shape

(5, 2)

We can do dictionary-style lookups into the dataframe by column name to get a single `Series`:

In [39]:
lakes['Max Depth (m)']

Erie         64
Huron       229
Michigan    281
Ontario     244
Superior    406
Name: Max Depth (m), dtype: int64

To select more than one column put a list of column names inside the dictionary-style square brackets:

In [40]:
lakes[['Max Depth (m)','Avg Depth (m)']]

          Max Depth (m)  Avg Depth (m)
Erie                 64             19
Huron               229             59
Michigan            281             85
Ontario             244             86
Superior            406            149

### Creating new columns

Once we have a `DataFrame`, creating new columns is done through simple assignment.

In [41]:
surface_area = pd.Series({
    'Superior': 82097,
    'Michigan': 57753,
    'Huron': 59565,
    'Erie': 25655,
    'Ontario': 19009,
})

lakes['Surface Area (sq km)'] = surface_area
lakes

          Max Depth (m)  Avg Depth (m)  Surface Area (sq km)
Erie                 64             19                 25655
Huron               229             59                 59565
Michigan            281             85                 57753
Ontario             244             86                 19009
Superior            406            149                 82097

Notice how the index values allowed pandas to "align" the new data with the existing data!

It's also possible to create new columns from existing columns. Say for example we wanted a column to track the difference between the avg depth and max depth. We'll call this the "depth spread".

In [42]:
lakes['Depth Spread'] = lakes['Max Depth (m)'] - lakes['Avg Depth (m)']
lakes

          Max Depth (m)  Avg Depth (m)  Surface Area (sq km)  Depth Spread
Erie                 64             19                 25655            45
Huron               229             59                 59565           170
Michigan            281             85                 57753           196
Ontario             244             86                 19009           158
Superior            406            149                 82097           257

DataFrames can be created from many different kinds of data structures (`Series` objects, lists, dictionaries, numpy arrays, etc.)

If you don't specify an index explicitly when creating the DataFrame, or you are using data without implicit indexes, pandas will create a `RangeIndex` for you:

In [43]:
call_signs = ['WLUW', 'WNUR', 'WBEZ', 'WXRT', 'WFMT']
frequencies = [88.7, 89.3, 91.5, 93.1, 98.7]
formats = ['College', 'College', 'Public Radio', 'Adult Album Alternative', 'Classical']
radio_station_df = pd.DataFrame(data={'Call Sign': call_signs, 'Frequency': frequencies, 'Format': formats})
radio_station_df

  Call Sign  Frequency                   Format
0      WLUW       88.7                  College
1      WNUR       89.3                  College
2      WBEZ       91.5             Public Radio
3      WXRT       93.1  Adult Album Alternative
4      WFMT       98.7                Classical

### Setting the index

You may want to "move" one of the columns to be the index. You can do this with the DataFrame's `set_index` method. By default this returns a new DataFrame with the index replaced with the values in the chosen column.

The `inplace` parameter will make the change to the existing DataFrame rather than returning a new one.

In [44]:
radio_station_df.set_index('Call Sign', inplace=True)
radio_station_df

           Frequency                   Format
Call Sign
WLUW            88.7                  College
WNUR            89.3                  College
WBEZ            91.5             Public Radio
WXRT            93.1  Adult Album Alternative
WFMT            98.7                Classical

It is possible to move the index back to a column with the `reset_index` method:

In [45]:
radio_station_df.reset_index(inplace=True)
radio_station_df

  Call Sign  Frequency                   Format
0      WLUW       88.7                  College
1      WNUR       89.3                  College
2      WBEZ       91.5             Public Radio
3      WXRT       93.1  Adult Album Alternative
4      WFMT       98.7                Classical

## DataFrame Exercise

Create a DataFrame using the data in these lists:
```
titles = ["Dangerously in Love", "B'Day", "I Am... Sasha Fierce", "4", "Beyoncé", "Lemonade"]
release_dates = ["2003-06-23", "2006-09-01", "2008-11-14", "2011-06-24", "2013-12-13", "2016-04-23"]
total_sales = [11000000, 8000000, 8000000, 2600000, 5000000, 2500000]
us_sales = [5000000, 3410000, 3200000, 1500000, 2300000, 1554000]
```

Each list should be a column.

In [52]:
titles = ["Dangerously in Love", "B'Day", "I Am... Sasha Fierce", "4", "Beyoncé", "Lemonade"]
release_dates = ["2003-06-23", "2006-09-01", "2008-11-14", "2011-06-24", "2013-12-13", "2016-04-23"]
total_sales = [11000000, 8000000, 8000000, 2600000, 5000000, 2500000]
us_sales = [5000000, 3410000, 3200000, 1500000, 2300000, 1554000]
albums_df = pd.DataFrame(data={'Album Title':titles,'Release Dates':release_dates,'Total Sales':total_sales,'US Sales': us_sales})
albums_df

            Album Title Release Dates  Total Sales  US Sales
0   Dangerously in Love    2003-06-23     11000000   5000000
1                 B'Day    2006-09-01      8000000   3410000
2  I Am... Sasha Fierce    2008-11-14      8000000   3200000
3                     4    2011-06-24      2600000   1500000
4               Beyoncé    2013-12-13      5000000   2300000
5              Lemonade    2016-04-23      2500000   1554000

Now change the DataFrame so that the index values are the album titles.

In [53]:
albums_df.set_index('Album Title', inplace=True)
albums_df

                     Release Dates  Total Sales  US Sales
Album Title
Dangerously in Love     2003-06-23     11000000   5000000
B'Day                   2006-09-01      8000000   3410000
I Am... Sasha Fierce    2008-11-14      8000000   3200000
4                       2011-06-24      2600000   1500000
Beyoncé                 2013-12-13      5000000   2300000
Lemonade                2016-04-23      2500000   1554000

Create a new column, "Non-US Sales", that contains the difference of the Total Sales and US Sales columns.

In [54]:
albums_df['Non-US Sales'] = albums_df['Total Sales'] - albums_df['US Sales']
albums_df

                     Release Dates  Total Sales  US Sales  Non-US Sales
Album Title
Dangerously in Love     2003-06-23     11000000   5000000       6000000
B'Day                   2006-09-01      8000000   3410000       4590000
I Am... Sasha Fierce    2008-11-14      8000000   3200000       4800000
4                       2011-06-24      2600000   1500000       1100000
Beyoncé                 2013-12-13      5000000   2300000       2700000
Lemonade                2016-04-23      2500000   1554000        946000

## Data Indexing and Selection

Now that we can load data into pandas objects, we need to be able to access it. Pandas offers a variety of methods for accessing the data we need.

First, both `Series` and `DataFrame` objects support dictionary-style access with square brackets. Think of index label values as dictionary keys:

In [55]:
# We saw this above -- access a series like a dictionary to get a single value.
avg_depths['Michigan']

85

In [56]:
# DataFrame dictionary-style access returns the Series with that column index label:
lakes['Avg Depth (m)']

Erie         19
Huron        59
Michigan     85
Ontario      86
Superior    149
Name: Avg Depth (m), dtype: int64

Boolean masking and fancy indexing work with DataFrames, just like Series objects:

In [57]:
# use a Boolean mask to select just the items we want:
lakes[avg_depths > 60]

          Max Depth (m)  Avg Depth (m)  Surface Area (sq km)  Depth Spread
Michigan            281             85                 57753           196
Ontario             244             86                 19009           158
Superior            406            149                 82097           257

In [58]:
lakes[lakes['Avg Depth (m)']> 60]

          Max Depth (m)  Avg Depth (m)  Surface Area (sq km)  Depth Spread
Michigan            281             85                 57753           196
Ontario             244             86                 19009           158
Superior            406            149                 82097           257

In [61]:
lakes[avg_depths > 60]['Surface Area (sq km)']

Michigan    57753
Ontario     19009
Superior    82097
Name: Surface Area (sq km), dtype: int64

This works because the Boolean mask creates a new `Series` with the same index values!

In [59]:
avg_depths > 60

Erie        False
Huron       False
Michigan     True
Ontario      True
Superior     True
dtype: bool

To select a subset of columns from a DataFrame, use fancy indexing with the column names in a list:

In [60]:
lakes[['Avg Depth (m)', 'Max Depth (m)']]

          Avg Depth (m)  Max Depth (m)
Erie                 19             64
Huron                59            229
Michigan             85            281
Ontario              86            244
Superior            149            406

In [62]:
# There is a potential problem with non-sequential integer indexes:
data_implicit = pd.Series([100, 200, 300, 400])
data_explicit = pd.Series([100, 200, 300, 400], index=[4, 9, 8, 1])
print('data_implicit')
print(data_implicit)
print()
print('data_explicit')
print(data_explicit)

data_implicit
0    100
1    200
2    300
3    400
dtype: int64

data_explicit
4    100
9    200
8    300
1    400
dtype: int64

To handle this potential confusion between label-based and position-based access and make data access easier in general, pandas provides two "indexers": `Series` and `DataFrame` attributes that expose differents ways to access the data.

- `iloc`: always integer position-based
- `loc`: always label-based

In [63]:
data_implicit.iloc[1]

200

In [64]:
data_explicit.iloc[1]

200

In [65]:
data_implicit.loc[4]  # Note that this should result in an error

KeyError: 4

In [66]:
data_explicit.loc[4] # # Note that this does not result in an error

100

In [67]:
# We can use slices to select more than one value as well. Here, get all values after the first one:
data_implicit.iloc[1:]

1    200
2    300
3    400
dtype: int64

In [69]:
# Let's get all rows of the lakes dataframe except the last one:
lakes.iloc[0:-1]

          Max Depth (m)  Avg Depth (m)  Surface Area (sq km)  Depth Spread
Erie                 64             19                 25655            45
Huron               229             59                 59565           170
Michigan            281             85                 57753           196
Ontario             244             86                 19009           158

These indexers (`.iloc` and `.loc`) take two parameters: the row index values to include, and the *column* index values to include. By default, all columns of a DataFrame are included, but it is possible to retrieve only a subset:

In [70]:
# The first two rows and first two columns only
lakes.iloc[:2, :2]

       Max Depth (m)  Avg Depth (m)
Erie              64             19
Huron            229             59

In [71]:
#grabs the row with index of Erie
lakes.loc['Erie']

Max Depth (m)              64
Avg Depth (m)              19
Surface Area (sq km)    25655
Depth Spread               45
Name: Erie, dtype: int64

In [72]:
#can grab just a value from the row
lakes.loc['Erie','Depth Spread']

45

`loc` accepts the following types of inputs:

- a single label (as above)
- a list or array of labels, e.g. ['a', 'b', 'c']
- a slice object with labels e.g. 'a':'c' (note that contrary to usual python slices, both the start and the stop are included!)
- A boolean array
- A callable function with one argument (the calling Series, DataFrame or Panel) and that returns valid output for indexing (one of the above)

In [73]:
lakes.loc[['Michigan', 'Superior'], ['Max Depth (m)']]

          Max Depth (m)
Michigan            281
Superior            406

It is also possible to assign to the values at the locations you specify with the `iloc` and `loc` indexers! They aren't read-only.

In [74]:
df = pd.DataFrame(np.random.randint(0, 10, (3, 3)), columns=['A', 'B', 'C'])
df

   A  B  C
0  6  5  6
1  7  3  5
2  1  6  4

In [75]:
# Assign the value 100 to the cells 0,B and 1,B.
# Remember with label-based access, which `loc` uses, the "stop" of the slice is *included*.
# this changes the original df because setting a value
df.loc[:1, 'B'] = 100
df

   A    B  C
0  6  100  6
1  7  100  5
2  1    6  4

## DataFrame Selection Exercise

Construct a DataFrame from the following data (note you can use the `index` parameter to `pd.DataFrame` to set the index when creating a DataFrame):
```
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
```

In [98]:
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
vet_df = pd.DataFrame(data, index = labels)
vet_df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

Display the first three rows using the `.iloc` indexer:

In [78]:
vet_df.iloc[:3]

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no

Display the last three rows using the `.iloc` indexer:

In [80]:
vet_df.iloc[-3:]

  animal  age  visits priority
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

Use the `.loc` indexer to access rows `a` through `d`:

In [82]:
vet_df.loc['a':'d']

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes

Display just the "animal" and "age" columns (you can use either the `.loc` indexer or dictionary-style access for this):

In [91]:
vet_df.loc[:,['animal','age']]

  animal  age
a    cat  2.5
b    cat  3.0
c  snake  0.5
d    dog  NaN
e    dog  5.0
f    cat  2.0
g  snake  4.5
h    cat  NaN
i    dog  7.0
j    dog  3.0

In [101]:
vet_df[['animal','age']]

  animal  age
a    cat  2.5
b    cat  3.0
c  snake  0.5
d    dog  NaN
e    dog  5.0
f    cat  2.0
g  snake  4.5
h    cat  NaN
i    dog  7.0
j    dog  3.0

Select the data where the animal's age is greater than 3:

In [100]:
vet_df[vet_df['age'] > 3]

  animal  age  visits priority
e    dog  5.0       2       no
g  snake  4.5       1       no
i    dog  7.0       2       no

In [102]:
vet_df[vet_df.age>3]

  animal  age  visits priority
e    dog  5.0       2       no
g  snake  4.5       1       no
i    dog  7.0       2       no

### Examining Data

While you can manipulate and operate on your data in any way you can dream up, pandas does provide basic descriptive statistics and sorting functionality for you. I **highly** recommend reading the [Pandas documentation](https://pandas.pydata.org/pandas-docs/stable/api.html#computations-descriptive-stats) to see what methods are available and save yourself some work!

The `describe` method is very useful with numeric data:

In [103]:
lakes.describe()

       Max Depth (m)  Avg Depth (m)  Surface Area (sq km)  Depth Spread
count       5.000000       5.000000              5.000000      5.000000
mean      244.800000      79.600000          48815.800000    165.200000
std       122.713895      47.389872          26114.771207     77.296184
min        64.000000      19.000000          19009.000000     45.000000
25%       229.000000      59.000000          25655.000000    158.000000
50%       244.000000      85.000000          57753.000000    170.000000
75%       281.000000      86.000000          59565.000000    196.000000
max       406.000000     149.000000          82097.000000    257.000000

We can get the highest value for a given Series with `max`:

In [104]:
lakes['Max Depth (m)'].max()

406

But what if we wanted the top 2? `sort_values` is the answer:

In [105]:
lakes['Max Depth (m)'].sort_values(ascending=False).head(2)

Superior    406
Michigan    281
Name: Max Depth (m), dtype: int64

This is so common that there is actually a shortcut for it:

In [106]:
max_depths.nlargest(2)

Superior    406
Michigan    281
dtype: int64

Which naturally works on DataFrames as well:

In [107]:
#in Avg Depth column and returning the rest of the columns
lakes.nlargest(2, 'Avg Depth (m)')

          Max Depth (m)  Avg Depth (m)  Surface Area (sq km)  Depth Spread
Superior            406            149                 82097           257
Ontario             244             86                 19009           158

## Loading Data

Pandas provides a bunch of functions for reading data from a variety of sources, including CSV, Excel files, SQL databases, HDF5, even your computer's clipboard! The always-comprehensive pandas documentation has more info here: [https://pandas.pydata.org/pandas-docs/stable/io.html](https://pandas.pydata.org/pandas-docs/stable/io.html).

Let's read a local CSV dataset into a dataframe using the `read_csv` function.

In [108]:
df = pd.read_csv("data/Speed_Camera_Violations.csv")

This particular `DataFrame` contains speed camera violation data provided by the city of Chicago. This dataset is available at [https://catalog.data.gov/dataset/speed-camera-violations-997eb](https://catalog.data.gov/dataset/speed-camera-violations-997eb).

Let's start inspecting it by using the `head` method to look at the first five rows.

In [109]:
df.head(5)

,ADDRESS,CAMERA ID,VIOLATION DATE,VIOLATIONS,X COORDINATE,Y COORDINATE,LATITUDE,LONGITUDE,LOCATION
0,7738 S WESTERN,CHI065,07/08/2014,65,NaN,NaN,NaN,NaN,NaN
1,1111 N HUMBOLDT,CHI010,07/16/2014,56,NaN,NaN,NaN,NaN,NaN
2,5520 S WESTERN,CHI069,07/08/2014,10,NaN,NaN,NaN,NaN,NaN
3,1111 N HUMBOLDT,CHI010,07/26/2014,101,NaN,NaN,NaN,NaN,NaN
4,1111 N HUMBOLDT,CHI010,07/27/2014,92,NaN,NaN,NaN,NaN,NaN

When data is loaded from an external source, pandas will try to guess the datatype for each column. Let's see how it did:

In [110]:
pd.Series({col: df[col].dtype for col in df.columns})

ADDRESS            object
CAMERA ID          object
VIOLATION DATE     object
VIOLATIONS          int64
X COORDINATE      float64
Y COORDINATE      float64
LATITUDE          float64
LONGITUDE         float64
LOCATION           object
dtype: object

## Data types

Much of pandas functionality depends on the data types of the `Series` it's working with. For instance we can get summary measures and do numpy-like parallel operations on numeric types (`int64`, `float64`), or do date-based arithmetic with `date` series.

Notice above that the data type of the `VIOLATION DATE` column is "object", which, just like in numpy, means it is a generic type that isn't very useful. Let's turn those date strings into actual date objects, which are much better to work with.

In [111]:
# given a Series, pd.to_datetime returns a new Series with the string dates parsed as actual dates.
# We can then directly assign that Series back to the original column in our dataframe and pandas' magical Index
# functionality will make it all line up properly.
df["VIOLATION DATE"] = pd.to_datetime(df["VIOLATION DATE"], format="%m/%d/%Y")

df["VIOLATION DATE"].head()

0   2014-07-08
1   2014-07-16
2   2014-07-08
3   2014-07-26
4   2014-07-27
Name: VIOLATION DATE, dtype: datetime64[ns]

## Filtering

Now that we have a date column, we can do things like filter to only look at violations in 2015.

To do this, we'll create a "filter", essentially a boolean expression that works just like a mask or "fancy indexing" expression in numpy, and apply that filter to our dataframe to get just the rows we want.

In [112]:
import datetime

# datetime.date() will create a datetime object (outside of pandas). 
# pd.Timestamp ensures that pandas interprets this date as a specific point in time. 
#   (rather than something else, for instance ... hypothetically ... the last day of the indicated
#   year. To avoid ambiguity, omission of pd.Timestamp will yield an error in future pandas versions,
#   and will already create a warning in current pandas versions.)

is_above_earliest_date = df["VIOLATION DATE"] >= pd.Timestamp(datetime.date(2015,1,1)) 
is_below_latest_date = df["VIOLATION DATE"] < pd.Timestamp(datetime.date(2016,1,1))

# now create a Boolean Mask where both of the above Boolean Masks,
# is_above_earliest_date and is_below_latest_date, are TRUE
date_filter = is_above_earliest_date & is_below_latest_date

# date_filter now contains a series of true/false values that we can use to extract just the values we are interested in
# by putting it in square brackets after the dataframe variable.
print(date_filter.head())
print()
print(date_filter.tail())

df_2015 = df[date_filter]

df_2015.head()

0    False
1    False
2    False
3    False
4    False
Name: VIOLATION DATE, dtype: bool

113991     True
113992     True
113993    False
113994     True
113995     True
Name: VIOLATION DATE, dtype: bool

,ADDRESS,CAMERA ID,VIOLATION DATE,VIOLATIONS,X COORDINATE,Y COORDINATE,LATITUDE,LONGITUDE,LOCATION
285,2912 W ROOSEVELT,CHI020,2015-01-07,8,1.157040e+06,1.894612e+06,41.866585,-87.698962,"(41.86658528313424, -87.69896237494204)"
286,5816 W JACKSON,CHI058,2015-01-07,22,1.137565e+06,1.898341e+06,41.877189,-87.770370,"(41.87718940463045, -87.7703695017756)"
287,57 E 95TH,CHI035,2015-01-07,4,1.178587e+06,1.841967e+06,41.721657,-87.621463,"(41.72165713317433, -87.62146289865515)"
288,324 S KEDZIE AVE,CHI123,2015-01-07,4,1.155058e+06,1.898247e+06,41.876599,-87.706143,"(41.87659894232968, -87.70614267856668)"
289,5471 W HIGGINS,CHI102,2015-01-07,14,1.139072e+06,1.931898e+06,41.969247,-87.764019,"(41.96924714863934, -87.76401945149458)"

This kind of filtering works for any kind of data type, provided you take care to make sure pandas is using the right data types for your data!

You may have noticed that many of the rows in this dataframe are missing lat/lon data. Pandas uses the "NaN" placeholder for missing data and offers some methods for dealing with it.

Both `Series` and `DataFrame` objects have `fillna` method that will replace missing data with a specified value.

In thise case however we may want to just drop those records that have missing data entirely:

In [113]:
df_no_nans = df.dropna(axis=0, how="any")
df_no_nans.head()

,ADDRESS,CAMERA ID,VIOLATION DATE,VIOLATIONS,X COORDINATE,Y COORDINATE,LATITUDE,LONGITUDE,LOCATION
148,2912 W ROOSEVELT,CHI020,2014-10-16,25,1.157040e+06,1.894612e+06,41.866585,-87.698962,"(41.86658528313424, -87.69896237494204)"
149,346 W 76th ST,CHI136,2014-10-16,4,1.175112e+06,1.854590e+06,41.756374,-87.633817,"(41.7563743554102, -87.6338165847716)"
150,11153 S VINCENNES,CHI022,2014-10-16,6,1.167029e+06,1.830594e+06,41.690702,-87.664122,"(41.690701951255015, -87.66412238501842)"
151,5454 W IRVING PARK,CHI050,2014-10-16,82,1.139043e+06,1.926097e+06,41.953330,-87.764267,"(41.95332954454448, -87.76426726425451)"
152,5446 W FULLERTON,CHI042,2014-10-16,38,1.139460e+06,1.915458e+06,41.924128,-87.762994,"(41.92412849125162, -87.76299399881007)"